src/InformationRegisters/ВремяРаботыСотрудниковФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВремяРаботыСотрудниковФакт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Минуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ВремяРаботыСотрудниковФакт/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция вернет отработанное вермя сотрудников за указанный период
Функция ПолучитьОтработанноеВремяСотрудников(СтруктурнаяЕдиница, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковФакт.Сотрудник КАК Сотрудник,
	|	СУММА(ВремяРаботыСотрудниковФакт.Минуты) КАК Время
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковФакт КАК ВремяРаботыСотрудниковФакт
	|ГДЕ
	|	ВремяРаботыСотрудниковФакт.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковФакт.ДатаВремяНачала >= &НачалоПериода
	|	И ВремяРаботыСотрудниковФакт.ДатаВремяНачала <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремяРаботыСотрудниковФакт.Сотрудник");
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

#КонецОбласти
